app/controllers/messages_controller.rb

  def create
    notification = Notification.find_by(slug: params["message"]["key"])
    if notification.present?
        message = Message.new(notification_id: notification.id, content: notification.message)

        if message.notification.captureSource == 0

            if message.notification.isSetIcon == 1
                icon_id = message.notification.icon
                icon_url = Icon.find_by(id: icon_id).attachment_url
            end

            if message.save
---
INSERT INTO `messages` (`created_at`, `updated_at`, `notification_id`, `content`) VALUES ('2017-09-03 12:21:09', '2017-09-03 12:21:09', 6, 'dsafdsfdasf')