app/controllers/notifications_controller.rb

INSERT INTO `notifications` (`name`, `captureSource`, `displayUrls`, `optimizeMode`, `message`, `created_at`, `updated_at`, `user_id`) VALUES ('345', 0, 'asdfasdf::::asdfdasfasdfsdfasdf::::', 3, 'qwerqwerqwrewerwqerqwer', '2017-08-30 14:00:26', '2017-08-30 14:00:26', 1)
---
  def create
    user = User.find_by(slug: params[:your_id])

    if user.present?
        @notification = Notification.new(:name => params[:name], :captureSource => params[:captureSource], :user_id => user.id,
                                       :displayUrls => params[:displayUrls], :message => params[:message], :time_after => params[:time_after],
                                       :duration => params[:duration], :fontFamily => params[:fontFamily], :fontSize => params[:fontSize],
                                       :fontColor => params[:fontColor], :backgroundColor => params[:backgroundColor], :opacity => params[:opacity],
                                       :corner => params[:corner], :borderRadius => params[:borderRadius], :icon => params[:icon],
                                       :isSetIcon => params[:isSetIcon], :messageAlignment => params[:messageAlignment])

        if @notification.save

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1
---
  def grab
    id = User.find_by(slug: params[:your_id]).id
    @notifications = Notification.where(user_id: id)