app/controllers/users_controller.rb

  def create
    @user = User.new(:firstName => params[:firstName], :lastName => params[:lastName],
                     :email => params[:email], :password => params[:password],
                     :password_confirmation => params[:password_confirmation])

    if @user.save
---
INSERT INTO `users` (`firstName`, `lastName`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Anatoly', 'Halfin', 'anatoly_halfin@outlook.com', '2017-08-29 22:43:01', '2017-08-29 22:43:01', '$2a$10$7keOflWKIgTJrymXLQx7uOV.j2jZjLSn24CXMMz/1870VCEKZJlAS')